{
    "ulcerative colitis": 0,
    "none": 1,
    "not relevant": 2,
    "yes": 3,
    "no": 4,
    "colonoscopy": 5,
    "1": 6,
    "0": 7,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-center; upper-left; upper-right": 8,
    "pink; red": 9,
    "pink; red; white": 10,
    "pink; red; white; yellow": 11,
    "center; center-right; lower-center; lower-left; lower-right; upper-center; upper-left; upper-right": 12,
    "center; center-left; center-right; lower-center; lower-right; upper-center; upper-left; upper-right": 13,
    "pink; red; yellow; white": 14,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-left; upper-right": 15,
    "pink; red; yellow": 16,
    "center; center-left; center-right; lower-left; lower-right; upper-center; upper-left; upper-right": 17,
    "center; center-right; lower-center; lower-right; upper-center; upper-right": 18,
    "center; center-right; lower-center; lower-left; lower-right; upper-center; upper-right": 19,
    "center; center-left; lower-center; lower-left; upper-center; upper-left": 20,
    "center; center-left; lower-center; lower-left; lower-right; upper-center; upper-left; upper-right": 21,
    "center-right; lower-right; upper-right": 22,
    "tube": 23,
    "center; center-left; center-right; lower-center; lower-left; upper-center; upper-left; upper-right": 24,
    "lower-center; lower-right": 25,
    "lower-right": 26,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-center; upper-left": 27,
    "biopsy forceps": 28,
    "pink; red; white; black": 29,
    "upper-right": 30,
    "upper-left; upper-right": 31,
    "center; center-left; center-right; lower-right; upper-center; upper-left; upper-right": 32,
    "2": 33,
    "center-right; lower-right": 34,
    "cecum": 35,
    "red": 36,
    "center-left; lower-left": 37,
    "metal clip": 38,
    "upper-center": 39,
    "red; grey": 40,
    "center; center-left": 41,
    "center-left; upper-center; upper-left": 42,
    "lower-center": 43,
    "polyp; ulcerative colitis": 44,
    "5-10mm": 45,
    "paris is": 46,
    "pink; red; orange": 47,
    "pink; red; brown": 48,
    "upper-center; upper-left": 49,
    "center; lower-center": 50,
    "center; lower-center; upper-center": 51,
    "center; center-right": 52,
    "upper-center; upper-right": 53,
    "center-right; upper-right": 54,
    "lower-center; lower-left": 55,
    "center; center-left; upper-left": 56,
    "center; center-left; lower-center": 57,
    "center": 58,
    "center; center-left; lower-center; lower-left": 59,
    "lower-right; upper-right": 60,
    "center-right": 61,
    "lower-left": 62,
    "pink; red; yellow; orange": 63,
    "center-left; upper-left": 64,
    "center; center-left; upper-center; upper-left": 65,
    "center; center-right; upper-center; upper-right": 66,
    "pink; red; white; brown": 67,
    "pink; red; brown; white": 68,
    "center; upper-center": 69,
    "center-left": 70,
    "center; center-right; lower-center; lower-right": 71,
    "center; lower-center; lower-right": 72,
    "pink; red; white; blue; grey": 73,
    "pink; white; yellow": 74,
    "pink; white; yellow; red": 75,
    "pink; yellow; white": 76,
    "pink; red; yellow; white; blue; grey": 77,
    "pink; blue; yellow; white; grey": 78,
    "white; pink; red": 79,
    "pink; white": 80,
    "pink; yellow": 81,
    "pink; yellow; green; white": 82,
    "pink; red; yellow; green; brown": 83,
    "pink; red; white; grey": 84,
    "pink; red; yellow; orange; white": 85,
    "pink; red; yellow; white; brown": 86,
    "capsule endoscopy": 87,
    "upper-left": 88,
    "pink; green; yellow; white": 89,
    "yellow; white; pink; red": 90,
    "pink; red; black": 91,
    "pink; white; grey": 92,
    "pink; red; yellow; green; white": 93,
    "pink; red; white; yellow; grey": 94,
    "pink; white; purple": 95,
    "pink; white; red": 96,
    "pink; red; yellow; white; grey": 97,
    "pink; red; yellow; green; white; grey": 98,
    "pink; yellow; orange": 99,
    "pink; red; yellow; green; grey; black": 100,
    "center; upper-center; upper-left": 101,
    "polyp snare": 102,
    "pink; red; white; grey; purple": 103,
    "pink; red; white; yellow; green": 104,
    "pink; yellow; white; orange; black": 105,
    "pink; white; yellow; orange; black": 106,
    "pink; white; yellow; black": 107,
    "pink; red; yellow; black": 108,
    "pink; red; white; yellow; black": 109,
    "pink; red; green; yellow; white": 110,
    "pink; red; grey; white": 111,
    "pink; red; yellow; white; green": 112,
    "center-left; lower-left; upper-left": 113,
    ">20mm": 114,
    "paris ip": 115,
    "center; lower-left; upper-center; upper-left": 116,
    "center; center-left; center-right; upper-center; upper-left; upper-right": 117,
    "pink; red; brown; yellow": 118,
    "pink; red; white; orange; yellow": 119,
    "pink; red; white; yellow; brown": 120,
    "11-20mm": 121,
    "3": 122,
    "white; yellow; pink; red": 123,
    "center-left; center-right; lower-left; lower-right; upper-left; upper-right": 124,
    "<5mm": 125,
    "ileum": 126,
    "pink; red; black; white": 127,
    "pink; red; brown; orange": 128,
    "center; center-left; center-right; lower-center; upper-center; upper-left; upper-right": 129,
    "center-right; lower-center; lower-right; upper-right": 130,
    "purple": 131,
    "hemorrhoids": 132,
    "pink; red; black; orange": 133,
    "brown; red": 134,
    "pink; red; orange; brown": 135,
    "pink; red; yellow; brown": 136,
    "polyp": 137,
    "paris iia": 138,
    "pink": 139,
    "center; lower-left": 140,
    "center; lower-center; lower-left; lower-right": 141,
    "center; center-left; center-right; lower-right": 142,
    "center; center-right; lower-center": 143,
    "center; center-left; lower-center; lower-left; upper-left": 144,
    "paris iia; paris is": 145,
    "pylorus": 146,
    "gastroscopy": 147,
    "red; pink": 148,
    "center; lower-right": 149,
    "center; center-left; center-right; lower-center; lower-left; lower-right": 150,
    "center; center-right; lower-center; lower-right; upper-right": 151,
    "center; center-left; upper-center": 152,
    "11-20mm;5-10mm": 153,
    "center; center-right; upper-right": 154,
    "upper-center; upper-left; upper-right": 155,
    "orange; pink": 156,
    "5": 157,
    "center; center-right; lower-right; upper-center; upper-right": 158,
    "11-20mm;5-10mm;<5mm": 159,
    "lower-center; lower-right; upper-right": 160,
    "center-left; lower-left; upper-center": 161,
    "5-10mm;<5mm": 162,
    "paris ip; paris is": 163,
    "center; upper-center; upper-right": 164,
    "center; center-right; lower-right": 165,
    "center; center-left; center-right; lower-center": 166,
    "injection needle": 167,
    "5-10mm;>20mm": 168,
    "center; center-right; upper-center": 169,
    "center; center-right; lower-center; lower-left; upper-center": 170,
    "paris iia; paris ip": 171,
    "center; center-left; center-right; lower-center; lower-right; upper-center; upper-right": 172,
    "center; center-left; center-right": 173,
    "<5mm;>20mm": 174,
    "center; center-left; lower-center; lower-left; upper-center; upper-right": 175,
    "center; upper-right": 176,
    "center; center-right; lower-center; lower-right; upper-center; upper-left": 177,
    "center; center-right; upper-center; upper-left": 178,
    "center; center-left; center-right; upper-center; upper-right": 179,
    "center; center-left; lower-left; upper-center; upper-left": 180,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-right": 181,
    "6": 182,
    "11-20mm;5-10mm;>20mm": 183,
    "red; white; pink": 184,
    "pink; white; red; yellow": 185,
    "center; center-left; lower-center; lower-left; lower-right; upper-center; upper-left": 186,
    "flesh; red": 187,
    "flesh; white": 188,
    "white; red; flesh": 189,
    "lower-left; upper-right": 190,
    "red; flesh; white": 191,
    "red; flesh": 192,
    "center; center-left; lower-left; upper-left": 193,
    "center; center-left; lower-left": 194,
    "flesh; red; orange": 195,
    "center; center-right; lower-right; upper-right": 196,
    "red; orange; yellow; white": 197,
    "white; flesh": 198,
    "white; flesh; yellow": 199,
    "center; center-right; lower-center; lower-right; upper-center; upper-left; upper-right": 200,
    "center; center-left; lower-center; lower-left; upper-center": 201,
    "flesh; white; red": 202,
    "center; center-right; lower-center; lower-right; upper-center": 203,
    "center-right; lower-center": 204,
    "red; white": 205,
    "center; center-left; lower-center; upper-center; upper-left": 206,
    "blue; red; flesh": 207,
    "center; center-left; lower-center; upper-center; upper-right": 208,
    "center; center-left; center-right; lower-center; lower-left": 209,
    "white; red": 210,
    "center-right; lower-center; lower-right": 211,
    "flesh; white; yellow": 212,
    "center; lower-center; lower-left": 213,
    "center; center-left; lower-center; upper-center": 214,
    "11-20mm;>20mm": 215,
    "center; center-left; center-right; lower-center; upper-center; upper-left": 216,
    "red; white; flesh": 217,
    "center-right; upper-center; upper-right": 218,
    "white; flesh; red": 219,
    "white; red; flesh; yellow": 220,
    "red; flesh; orange": 221,
    "flesh; red; white": 222,
    "center-left; upper-center": 223,
    "flesh": 224,
    "flesh; yellow; white": 225,
    "center; center-right; upper-center; upper-left; upper-right": 226,
    "red; white; yellow": 227,
    "4": 228,
    "white; red; yellow": 229,
    "center-right; lower-right; upper-center": 230,
    "orange; flesh; red": 231,
    "white; yellow; flesh": 232,
    "yellow; white; flesh": 233,
    "center; center-right; upper-left; upper-right": 234,
    "red; flesh; purple": 235,
    "center; center-right; lower-center; lower-left; lower-right; upper-right": 236,
    "white; red; yellow; flesh": 237,
    "center; center-left; center-right; upper-center": 238,
    "orange; red; flesh": 239,
    "white; yellow; red; flesh": 240,
    "orange; flesh; white": 241,
    "yellow; flesh; white": 242,
    "center; center-left; center-right; lower-center; lower-right; upper-left": 243,
    "11-20mm;<5mm": 244,
    "yellow; red; flesh": 245,
    "red; pink; yellow": 246,
    "center-left; lower-center; lower-left; upper-center; upper-left; upper-right": 247,
    "center; center-left; center-right; lower-center; lower-left; upper-center; upper-left": 248,
    "white; flesh; orange": 249,
    "white; flesh; blue; red": 250,
    "center; lower-center; upper-center; upper-left": 251,
    "center-right; lower-center; lower-right; upper-center; upper-right": 252,
    "flesh; white; yellow; red": 253,
    "center-left; center-right; lower-center; lower-left; upper-center; upper-left; upper-right": 254,
    "center-left; center-right; lower-left; lower-right; upper-center; upper-left; upper-right": 255,
    "yellow; flesh; red": 256,
    "center-left; lower-left; upper-center; upper-left": 257,
    "center-left; lower-center; lower-left; upper-left": 258,
    "red; yellow; flesh; white": 259,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-center; upper-right": 260,
    "center; center-left; center-right; lower-center; upper-center": 261,
    "center-right; lower-center; lower-left; lower-right": 262,
    "center; center-right; lower-left; upper-right": 263,
    "center; center-left; center-right; lower-center; lower-left; upper-right": 264,
    "red; flesh; yellow": 265,
    "orange; flesh": 266,
    "center; center-right; lower-center; upper-center": 267,
    "center; center-left; center-right; upper-right": 268,
    "center; center-left; center-right; lower-center; lower-right": 269,
    "flesh; yellow": 270,
    "white; yellow": 271,
    "flesh; yellow; red": 272,
    "flesh; red; yellow; white": 273,
    "center; center-left; center-right; lower-center; upper-center; upper-right": 274,
    "white; pink": 275,
    "center; center-left; lower-center; lower-left; lower-right; upper-left": 276,
    "center; center-left; center-right; lower-right; upper-center; upper-left": 277,
    "pink; grey; red": 278,
    "yellow": 279,
    "center; center-right; lower-center; lower-left; upper-center; upper-right": 280,
    "yellow; red": 281,
    "barretts": 282,
    "center; center-left; upper-center; upper-left; upper-right": 283,
    "white; pink; yellow": 284,
    "pink; yellow; red": 285,
    "pink; blue; red; grey; white": 286,
    "red; pink; yellow; white": 287,
    "orange; pink; white": 288,
    "center; center-left; lower-center; lower-right; upper-center; upper-left": 289,
    "center; center-left; center-right; lower-center; lower-right; upper-center; upper-left": 290,
    "pink; red; white; purple": 291,
    "pink; yellow; red; white": 292,
    "pink; white; red; green": 293,
    "lower-right; upper-left": 294,
    "orange; yellow; pink": 295,
    "center-right; upper-center; upper-left; upper-right": 296,
    "yellow; green; pink": 297,
    "red; brown; pink": 298,
    "center; center-left; lower-center; lower-right": 299,
    "center; center-left; center-right; upper-center; upper-left": 300,
    "red; pink; white": 301,
    "red; pink; grey": 302,
    "16": 303,
    "center; center-right; lower-center; lower-left; lower-right": 304,
    "center; lower-right; upper-center; upper-right": 305,
    "z-line": 306,
    "lower-center; upper-center": 307,
    "red; pink; brown": 308,
    "center; center-left; center-right; lower-center; upper-left": 309,
    "pink; yellow; white; red": 310,
    "center; center-left; lower-center; lower-left; lower-right": 311,
    "red; yellow; pink": 312,
    "center; lower-center; lower-left; lower-right; upper-right": 313,
    "center; center-left; lower-center; upper-left": 314,
    "red; white; pink; yellow": 315,
    "center; center-right; lower-center; lower-right; upper-left": 316,
    "white; red; pink": 317,
    "center-left; lower-center; upper-left": 318,
    "red; pink; white; brown": 319,
    "center; center-left; lower-center; upper-center; upper-left; upper-right": 320,
    "center; center-left; lower-left; upper-center": 321,
    "center; center-right; lower-center; upper-center; upper-right": 322,
    "red; pink; yellow; brown": 323,
    "yellow; pink; brown": 324,
    "center-right; lower-center; lower-left; lower-right; upper-right": 325,
    "center; center-left; lower-left; upper-center; upper-left; upper-right": 326,
    "yellow; pink": 327,
    "red; pink; orange": 328,
    "center; center-left; center-right; lower-center; lower-right; upper-center": 329,
    "pink; brown": 330,
    "red; orange; pink": 331,
    "center; upper-left": 332,
    "center; center-right; lower-center; lower-left": 333,
    "red; pink; brown; yellow": 334,
    "red; pink; brown; white": 335,
    "lower-center; lower-left; upper-right": 336,
    "center; center-left; center-right; lower-center; lower-left; upper-center; upper-right": 337,
    "center; center-left; center-right; lower-left; upper-center; upper-left; upper-right": 338,
    "center-left; center-right; lower-center; lower-right": 339,
    "yellow; pink; red": 340,
    "center; center-right; lower-center; upper-right": 341,
    "flesh; yellow; orange": 342,
    "flesh; pink": 343,
    "flesh; pink; yellow; orange": 344,
    "flesh; pink; red": 345,
    "flesh; pink; white; red; yellow": 346,
    "flesh; pink; red; yellow; orange": 347,
    "flesh; pink; yellow": 348,
    "flesh; pink; yellow; red": 349,
    "pink; white; orange": 350,
    "center; center-left; center-right; lower-center; lower-left; upper-center": 351,
    "center-left; lower-center; lower-left": 352,
    "pink; yellow; brown": 353,
    "pink; brown; white; flesh": 354,
    "pink; white; brown": 355,
    "pink; flesh": 356,
    "white; yellow; pink": 357,
    "polyp; short-segment barretts": 358,
    "pink; orange; brown": 359,
    "red; pink; white; yellow": 360,
    "center; center-right; lower-left; upper-left": 361,
    "brown; red; pink": 362,
    "orange; brown": 363,
    "pink; brown; grey; white": 364,
    "white; pink; red; brown": 365,
    "center-left; lower-left; upper-center; upper-left; upper-right": 366,
    "white; red; pink; yellow": 367,
    "pink; orange": 368,
    "pink; orange; yellow": 369,
    "center; lower-center; lower-right; upper-left": 370,
    "center; center-left; lower-center; lower-left; upper-right": 371,
    "yellow; pink; white": 372,
    "oesophagitis": 373,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-center": 374,
    "center-left; center-right; lower-center; lower-right; upper-center; upper-left; upper-right": 375,
    "grey; white; red; pink": 376,
    "brown; pink; white": 377,
    "pink; red; grey": 378,
    "brown": 379,
    "red; brown; white": 380,
    "center-left; center-right; lower-center; lower-left; lower-right; upper-center; upper-left; upper-right": 381,
    "pink; grey; white": 382,
    "pink; grey": 383,
    "center; center-left; lower-center; lower-right; upper-center": 384,
    "red; pink; white; grey": 385,
    "yellow; white; pink": 386,
    "center; lower-center; upper-center; upper-right": 387,
    "center; center-left; lower-center; lower-left; upper-center; upper-left; upper-right": 388,
    "center; upper-center; upper-left; upper-right": 389,
    "oesophagitis; polyp": 390,
    "center-left; center-right; lower-center; upper-center": 391,
    "center; center-right; lower-center; lower-left; lower-right; upper-center": 392,
    "center; center-right; lower-right; upper-center; upper-left; upper-right": 393,
    "center; center-left; center-right; lower-left; lower-right; upper-center; upper-right": 394,
    "center-left; lower-center; upper-center": 395,
    "center-right; lower-right; upper-center; upper-right": 396,
    "center; center-left; upper-center; upper-right": 397,
    "center; center-left; center-right; lower-center; lower-left; lower-right; upper-left": 398,
    "pink; purple; white": 399,
    "center-right; lower-right; upper-center; upper-left; upper-right": 400,
    "center; lower-center; lower-left; upper-center; upper-left": 401,
    "center; center-right; lower-center; upper-center; upper-left; upper-right": 402,
    "center-right; lower-center; lower-left; lower-right; upper-center; upper-left; upper-right": 403,
    "center; lower-left; upper-center": 404,
    "center-right; lower-center; upper-center; upper-right": 405,
    "center-right; lower-left; lower-right; upper-right": 406,
    "center-right; lower-center; upper-center": 407,
    "center-right; lower-center; lower-left; lower-right; upper-center; upper-right": 408,
    "center-left; lower-center; lower-left; upper-center; upper-left": 409,
    "center-left; center-right; lower-center; lower-left; lower-right; upper-center; upper-right": 410,
    "center; center-left; lower-center; lower-right; upper-right": 411,
    "center; center-left; lower-center; lower-right; upper-center; upper-right": 412,
    "center; center-right; lower-center; lower-left; upper-center; upper-left; upper-right": 413,
    "center; lower-center; lower-left; upper-center": 414,
    "center; lower-left; lower-right; upper-center; upper-left": 415,
    "center-right; lower-center; upper-center; upper-left; upper-right": 416,
    "center-left; center-right; upper-center": 417,
    "barretts; oesophagitis": 418,
    "oesophagitis; short-segment barretts": 419,
    "black; white": 420,
    "black": 421,
    "grey; white": 422,
    "black; grey; white": 423,
    "grey; black; white": 424,
    "center; lower-center; lower-left; upper-left": 425,
    "lower-center; lower-left; upper-center": 426,
    "center; lower-right; upper-right": 427,
    "center; center-left; lower-right; upper-center; upper-left; upper-right": 428,
    "center; lower-center; lower-right; upper-center": 429,
    "center-left; center-right; upper-center; upper-left": 430,
    "center-left; lower-center": 431,
    "red; brown; pink; orange": 432,
    "pink; purple": 433,
    "pink; yellow; purple": 434,
    "polyp snare; tube": 435,
    "biopsy forceps; tube": 436,
    "metal clip; polyp snare": 437,
    "center; lower-center; lower-right; upper-center; upper-left": 438,
    "lower-center; lower-right; upper-center; upper-right": 439,
    "white; purple": 440,
    "green; white": 441,
    "center; center-left; lower-center; lower-right; upper-left": 442,
    "blue; white; yellow": 443,
    "center; center-right; lower-right; upper-center": 444,
    "metal clip; tube": 445,
    "center; center-right; lower-left": 446,
    "flesh; red; yellow": 447,
    "biopsy forceps; metal clip": 448,
    "grey": 449,
    "flesh; blue; red": 450,
    "lower-center; lower-right; upper-center; upper-left": 451,
    "flesh; blue": 452,
    "white; blue; green": 453,
    "pink; grey; green": 454,
    "red; orange": 455,
    "center-right; upper-center; upper-left": 456,
    "center-left; lower-center; lower-left; lower-right; upper-center; upper-left": 457,
    "white; pink; brown": 458,
    "white; blue; pink": 459,
    "blue; grey": 460,
    "center; center-right; lower-center; lower-left; upper-left": 461,
    "center; center-right; lower-center; lower-left; upper-right": 462,
    "center; center-right; lower-center; upper-center; upper-left": 463,
    "center; center-right; lower-right; upper-center; upper-left": 464,
    "white; pink; grey": 465,
    "white; blue": 466,
    "blue; green; white": 467,
    "blue; green": 468
}